/**
 * @file   GameLibInput.cpp
 *
 * @brief  入力関連のソースファイル
 *
 * @author S.Takaki
 *
 * @date   2023/04/12
 */

// ヘッダファイルの読み込み ===================================================
#include "GameLibInput.h"





// メンバ関数の定義 ===========================================================
namespace GameLib
{
	//*********************************************************************
	// 
	// ジョイパッド
	// 
	//*********************************************************************

	//-----------------------------------------------------------------
	// デフォルトコンストラクタ
	//-----------------------------------------------------------------
	Joypad::Joypad(int inputType)
		: m_inputType{ inputType }
		, m_currentInputState{ 0 }
		, m_lastInputState{ 0 }
	{

	}



	//-----------------------------------------------------------------
	// 入力状態の更新
	//-----------------------------------------------------------------
	void Joypad::Update()
	{
		// 状態の履歴を保存
		m_lastInputState = m_currentInputState;


		// ゲームパッドの現在の状態を取得
		m_currentInputState = GetJoypadInputState(m_inputType);
	}



	//-----------------------------------------------------------------
	// 指定されたボタンが押されているかどうかを判断
	//-----------------------------------------------------------------
	bool Joypad::IsButtonDown(int button)
	{
		return ((m_currentInputState & button) == button);
	}



	//-----------------------------------------------------------------
	// 指定されたボタンが押されていないかどうかを判断
	//-----------------------------------------------------------------
	bool Joypad::IsButtonUp(int button)
	{
		return ((m_currentInputState & button) != button);
	}



	//-----------------------------------------------------------------
	// 指定されたボタンが押されたかどうかを判断
	//-----------------------------------------------------------------
	bool Joypad::IsButtonPressed(int button)
	{
		return (((~m_lastInputState & m_currentInputState) & button) == button);
	}



	//-----------------------------------------------------------------
	// 指定されたボタンが離されたかどうかを判断
	//-----------------------------------------------------------------
	bool Joypad::IsButtonReleased(int button)
	{
		return (((m_lastInputState & ~m_currentInputState) & button) == button);
	}

} // namespace GameLib